---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SweepTrajSegmented
source: html/3f138581-5f46-88a7-e51a-237c23f73f26.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SweepTrajSegmented Property

"Trajectory Segmentation"

## Syntax (C#)
```csharp
public static ForgeTypeId SweepTrajSegmented { get; }
```